In [40]:
import pandas as pd
import sqlite3 as sql
import pyodbc
from sqlalchemy import create_engine
import urllib

In [41]:
Northwind = {
    'servername': r'MAX-PC-DEC-2023\SQLEXPRESS',
    'database': 'Northwind'
}

Adventure = {
    'servername': r'MAX-PC-DEC-2023\SQLEXPRESS',
    'database': 'AdventureWorks2019'
}

In [42]:
aenc_connection = sql.connect("../data/aenc.sqlite")
adventure_connection = pyodbc.connect('DRIVER={SQL Server};SERVER=' + Adventure['servername'] + ';DATABASE=' + Adventure['database'] + ';Trusted_Connection=yes')
northwind_connection = pyodbc.connect('DRIVER={SQL Server};SERVER=' + Northwind['servername'] + ';DATABASE=' + Northwind['database'] + ';Trusted_Connection=yes')

In [43]:
northwind_query = """
SELECT 
    EmployeeID AS Id, 
    'NW' AS 'Database', 
    FirstName, 
    LastName,
    BirthDate AS BirthDate, 
    Address, 
    City, 
    Region, 
    PostalCode, 
    Country, 
    HomePhone AS PhoneNumber, 
    NULL AS Sex,
    HireDate AS StartDate, 
    ReportsTo AS ManagerId, 
    NULL AS TerminationDate
FROM Employees
"""

# Executing the query and storing the results in a DataFrame
northwind_df = pd.read_sql_query(northwind_query, northwind_connection)

northwind_df

C:\Users\Maxhb\AppData\Local\Temp\ipykernel_28972\246464268.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  northwind_df = pd.read_sql_query(northwind_query, northwind_connection)

,Id,Database,FirstName,LastName,BirthDate,Address,City,Region,PostalCode,Country,PhoneNumber,Sex,StartDate,ManagerId,TerminationDate
0,1,NW,Nancy,Davolio,1948-12-08,507 - 20th Ave. E.Apt. 2A,Seattle,WA,98122,USA,(206) 555-9857,None,1992-05-01,2.0,None
1,2,NW,Andrew,Fuller,1952-02-19,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,None,1992-08-14,NaN,None
2,3,NW,Janet,Leverling,1963-08-30,722 Moss Bay Blvd.,Kirkland,WA,98033,USA,(206) 555-3412,None,1992-04-01,2.0,None
3,4,NW,Margaret,Peacock,1937-09-19,4110 Old Redmond Rd.,Redmond,WA,98052,USA,(206) 555-8122,None,1993-05-03,2.0,None
4,5,NW,Steven,Buchanan,1955-03-04,14 Garrett Hill,London,None,SW1 8JR,UK,(71) 555-4848,None,1993-10-17,2.0,None
5,6,NW,Michael,Suyama,1963-07-02,Coventry House\nMiner Rd.,London,None,EC2 7JR,UK,(71) 555-7773,None,1993-10-17,5.0,None
6,7,NW,Robert,King,1960-05-29,Edgeham Hollow\nWinchester Way,London,None,RG1 9SP,UK,(71) 555-5598,None,1994-01-02,5.0,None
7,8,NW,Laura,Callahan,1958-01-09,4726 - 11th Ave. N.E.,Seattle,WA,98105,USA,(206) 555-1189,None,1994-03-05,2.0,None
8,9,NW,Anne,Dodsworth,1966-01-27,7 Houndstooth Rd.,London,None,WG2 7LT,UK,(71) 555-4444,None,1994-11-15,5.0,None

In [44]:
test1 = pd.read_sql_query("select * from employee", aenc_connection)

aenc_query = """
SELECT 
    employee.emp_id AS Id, 
    'AE' AS 'Database', 
    employee.emp_fname as FirstName, 
    employee.emp_lname as LastName,
    employee.birth_date AS BirthDate,
    employee.street as Address, 
    employee.city as City, 
    state.state_name AS Region,
    employee.zip_code as PostalCode, 
    state.country as Country, 
    employee.phone AS PhoneNumber, 
    employee.sex as Sex,
    employee.start_date AS StartDate, 
    employee.manager_id AS ManagerId, 
    employee.termination_date as TerminationDate
FROM employee
JOIN state ON employee.state = state.state_id
"""

aenc_df = pd.read_sql_query(aenc_query, aenc_connection)

aenc_df

,Id,Database,FirstName,LastName,BirthDate,Address,City,Region,PostalCode,Country,PhoneNumber,Sex,StartDate,ManagerId,TerminationDate
0,102,AE,Fran,Whitney,05-Jun-1959 12:00:00 AM,49 East Washington Street,Needham,Massachusetts,02192,USA,6175553985,F,26-Feb-1987 12:00:00 AM,501,
1,105,AE,Matthew,Cobb,04-Dec-1961 12:00:00 AM,77 Pleasant Street,Waltham,Massachusetts,02154,USA,6175553840,M,02-Jul-1987 12:00:00 AM,501,
2,129,AE,Philip,Chin,30-Oct-1967 12:00:00 AM,59 Pond Street,Atlanta,Georgia,30339,USA,4045552341,M,04-Aug-1998 12:00:00 AM,902,
3,148,AE,Julie,Jordan,13-Dec-1952 12:00:00 AM,144 Great Plain Avenue,Winchester,Massachusetts,01890,USA,6175557835,F,04-Oct-1997 12:00:00 AM,1293,
4,160,AE,Robert,Breault,13-May-1948 12:00:00 AM,58 Cherry Street,Milton,Massachusetts,02186,USA,6175553099,M,16-Dec-1987 12:00:00 AM,501,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
70,1643,AE,Elizabeth,Lambert,12-Sep-1969 12:00:00 AM,29 Union Street,Burlington,Massachusetts,01803,USA,6175552357,F,15-Jun-1997 12:00:00 AM,1576,
71,1658,AE,Michael,Lynch,18-Jan-1974 12:00:00 AM,76 Brookside Road,Waltham,Massachusetts,02154,USA,6175558348,M,28-Aug-1997 12:00:00 AM,703,
72,1684,AE,Janet,Hildebrand,31-Oct-1970 12:00:00 AM,47 Hilltop Street,Waltham,Massachusetts,02154,USA,6175553845,F,13-Sep-1997 12:00:00 AM,1576,
73,1740,AE,Robert,Nielsen,19-Jun-1966 12:00:00 AM,55 Sargent Avenue,Bedford,Massachusetts,01730,USA,6175558757,M,23-Dec-1997 12:00:00 AM,1576,
74,1751,AE,Alex,Ahmed,12-Dec-1964 12:00:00 AM,114 Cushing Street,Needham,Massachusetts,02192,USA,6175558748,M,10-Jan-1998 12:00:00 AM,1576,

In [45]:
adventure_query = """
SELECT 
    e.BusinessEntityID AS Id, 
    'AW' AS 'Database',
    p.FirstName, 
    p.LastName, 
    e.BirthDate AS BirthDate, 
    a.AddressLine1 AS Address, 
    a.City, 
    sp.Name AS Region, 
    a.PostalCode, 
    cr.Name AS Country,
    pp.PhoneNumber, 
    e.Gender AS Sex,
    e.HireDate AS StartDate,
    NULL AS TerminationDate,
    NULL AS ManagerId
FROM HumanResources.Employee e
JOIN Person.Person p ON e.BusinessEntityID = p.BusinessEntityID
JOIN Person.BusinessEntityAddress bea ON e.BusinessEntityID = bea.BusinessEntityID
JOIN Person.Address a ON bea.AddressID = a.AddressID
JOIN Person.StateProvince sp ON a.StateProvinceID = sp.StateProvinceID
JOIN Person.CountryRegion cr ON sp.CountryRegionCode = cr.CountryRegionCode
LEFT JOIN Person.PersonPhone pp ON p.BusinessEntityID = pp.BusinessEntityID
"""




adventure_df = pd.read_sql_query(adventure_query, adventure_connection)

adventure_df

C:\Users\Maxhb\AppData\Local\Temp\ipykernel_28972\4285207413.py:30: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  adventure_df = pd.read_sql_query(adventure_query, adventure_connection)

,Id,Database,FirstName,LastName,BirthDate,Address,City,Region,PostalCode,Country,PhoneNumber,Sex,StartDate,TerminationDate,ManagerId
0,259,AW,Ben,Miller,1973-06-03,101 Candy Rd.,Redmond,Washington,98052,United States,151-555-0113,M,2010-03-09,None,None
1,278,AW,Garrett,Vargas,1975-02-04,10203 Acorn Avenue,Calgary,Alberta,T2P 2G8,Canada,922-555-0165,M,2011-05-31,None,None
2,204,AW,Gabe,Mares,1988-05-10,1061 Buskrik Avenue,Edmonds,Washington,98020,United States,310-555-0117,M,2009-03-08,None,None
3,78,AW,Reuben,D'sa,1987-08-27,1064 Slow Creek Road,Seattle,Washington,98104,United States,191-555-0112,M,2008-12-15,None,None
4,255,AW,Gordon,Hee,1966-11-29,108 Lakeside Court,Bellevue,Washington,98004,United States,230-555-0144,M,2010-01-11,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
285,18,AW,John,Wood,1978-03-06,9906 Oak Grove Road,Redmond,Washington,98052,United States,486-555-0150,M,2011-02-07,None,None
286,46,AW,Eugene,Kogan,1976-02-10,991 Vista Verde,Duvall,Washington,98019,United States,173-555-0179,M,2009-02-08,None,None
287,202,AW,Tawana,Nusbaum,1989-11-10,9964 North Ridge Drive,Seattle,Washington,98104,United States,368-555-0113,M,2009-02-05,None,None
288,289,AW,Jae,Pak,1968-03-17,Downshire Way,Cambridge,England,BA5 3HX,United Kingdom,1 (11) 500 555-0145,F,2012-05-30,None,None
289,288,AW,Rachel,Valdez,1975-07-09,Pascalstr 951,Berlin,Hamburg,14111,Germany,1 (11) 500 555-0140,F,2013-05-30,None,None

In [46]:
employees = pd.concat([northwind_df, aenc_df, adventure_df])
employees

,Id,Database,FirstName,LastName,BirthDate,Address,City,Region,PostalCode,Country,PhoneNumber,Sex,StartDate,ManagerId,TerminationDate
0,1,NW,Nancy,Davolio,1948-12-08 00:00:00,507 - 20th Ave. E.Apt. 2A,Seattle,WA,98122,USA,(206) 555-9857,None,1992-05-01 00:00:00,2.0,None
1,2,NW,Andrew,Fuller,1952-02-19 00:00:00,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,None,1992-08-14 00:00:00,NaN,None
2,3,NW,Janet,Leverling,1963-08-30 00:00:00,722 Moss Bay Blvd.,Kirkland,WA,98033,USA,(206) 555-3412,None,1992-04-01 00:00:00,2.0,None
3,4,NW,Margaret,Peacock,1937-09-19 00:00:00,4110 Old Redmond Rd.,Redmond,WA,98052,USA,(206) 555-8122,None,1993-05-03 00:00:00,2.0,None
4,5,NW,Steven,Buchanan,1955-03-04 00:00:00,14 Garrett Hill,London,None,SW1 8JR,UK,(71) 555-4848,None,1993-10-17 00:00:00,2.0,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
285,18,AW,John,Wood,1978-03-06,9906 Oak Grove Road,Redmond,Washington,98052,United States,486-555-0150,M,2011-02-07,None,None
286,46,AW,Eugene,Kogan,1976-02-10,991 Vista Verde,Duvall,Washington,98019,United States,173-555-0179,M,2009-02-08,None,None
287,202,AW,Tawana,Nusbaum,1989-11-10,9964 North Ridge Drive,Seattle,Washington,98104,United States,368-555-0113,M,2009-02-05,None,None
288,289,AW,Jae,Pak,1968-03-17,Downshire Way,Cambridge,England,BA5 3HX,United Kingdom,1 (11) 500 555-0145,F,2012-05-30,None,None
289,288,AW,Rachel,Valdez,1975-07-09,Pascalstr 951,Berlin,Hamburg,14111,Germany,1 (11) 500 555-0140,F,2013-05-30,None,None